import type { Meta, StoryObj } from '@storybook/nextjs';
import CeoSpeech from '@/components/organisms/CeoSpeech';
import { data } from '@/components/organisms/CeoSpeech/CeoSpeech.data';

const meta: Meta<typeof CeoSpeech> = {
  title: 'Organisms/CeoSpeech',
  component: CeoSpeech,
  tags: ['autodocs'],
  parameters: {
    layout: 'fullscreen',
    nextjs: {
      appDirectory: true,
      navigation: {
        pathname: '/',
      },
    },
  },
};

export default meta;
type Story = StoryObj<typeof CeoSpeech>;

export const Default: Story = {
  args: data,
};

const dataRTL = {
  title: 'كلمة الرئيس التنفيذي',
  quote:
    'تعمل الإستراتيجية الوطنية للملكية الفكرية أيضًا على تعظيم المكاسب والأصول غير الملموسة المتعلقة بالملكية الفكرية من خلال بناء وتوجيه منظومة الملكية الفكرية بطريقة تحقق الانسجام والتكامل مع المنظومات الاقتصادية.',
  image: {
    src: '/images/about/ceo.jpeg',
    alt: 'معالي الرئيس التنفيذي للهيئة السعودية للملكية الفكرية الدكتور عبدالعزيز السويلم',
  },
  caption: 'معالي الرئيس التنفيذي للهيئة السعودية للملكية الفكرية',
  captionHighlight: 'الدكتور عبدالعزيز السويلم',
  description: [
    'لقد وضعت رؤية السعودية 2030 الملكية الفكرية ضمن أولوياتها، والتي شملت إنشاء الهيئة السعودية للملكية الفكرية (SAIP) انطلاقًا من اهتمام القيادة الرشيدة بقطاع الملكية الفكرية، للاستمرار في السعي نحو التقدم والتميز في هذا المجال. وتسعى أسرة الهيئة من خلال موقعها الإلكتروني إلى تقديم كافة الخدمات والمنتجات بجودة عالية لمختلف المبدعين والمبدعات في المملكة العربية السعودية بهدف تحقيق رضا العملاء.',
    'نعمل في الهيئة بوتيرة متسارعة لتحقيق الأهداف التي أُسست من أجلها، والاستمرار في تحقيق الإنجازات من خلال تسجيل وفحص الطلبات، وتنفيذ حملات التوعية والتنفيذ في مجال الملكية الفكرية في مختلف مناطق المملكة، والانضمام إلى المعاهدات الدولية والاتفاقيات المحلية، وتعزيز الشراكات الاستراتيجية الدولية المتوافقة مع مجالها ودعم توجهها والمساهمة في تمكين توليد واستغلال حقوق الملكية الفكرية من خلال التعاون والدعم للأطراف المساهمة في خلق واستخدام الملكية الفكرية. كما تسهل الهيئة جمع المعلومات اللازمة ومساعدة المستفيدين من خلال توضيح وشرح كيفية استخدام المعلومات.',
    'ترتكز إستراتيجية الإنفاذ على رفع مستوى المملكة إقليميًا وعالميًا في مجال حماية حقوق الملكية الفكرية من خلال خلق بيئة أعمال جاذبة تُمكن من الابتكار والمعرفة والاستثمار، يشارك فيها أصحاب المصلحة من القطاعين العام والخاص لتفعيل وتعزيز منظومة الإنفاذ. كما تعمل الهيئة على تعظيم المكاسب والأصول غير الملموسة المرتبطة بالملكية الفكرية من خلال بناء وتوجيه منظومة الملكية الفكرية بطريقة تحقق الانسجام والتكامل مع المنظومات الاقتصادية التنموية.',
    'آمل أن يحظى زوار الموقع الإلكتروني برحلة غنية في مسارات عمل الهيئة والتي تشمل التسجيل، والأكاديمية، والتمكين، والتنفيذ، والتقاضي.',
  ],
};

export const RTL: Story = {
  args: {
    ...dataRTL,
  },
  parameters: {
    direction: 'rtl',
    nextjs: {
      appDirectory: true,
      navigation: {
        pathname: '/',
      },
    },
  },
};

export const Tablet: Story = {
  ...Default,
  globals: {
    viewport: { value: 'tablet' },
  },
};

export const Mobile: Story = {
  ...Default,
  globals: {
    viewport: { value: 'mobile1' },
  },
};
